{
    "AllRecipe": [
  {
    "id": 1,
    "recipename": "ભેલ સાંચોરી સ્ટ્રીટ ફૂડ",
    "Tag": "Breakfast",
    "recipedetail": "સામગ્રી:\n\n- 2 કપ પફ્ડ રાઇસ (મુરમુરા)\n- 1/2 કપ બારીક સમારેલી ડુંગળી\n- 1/2 કપ બારીક સમારેલા ટામેટાં\n- 1/2 કપ બાફેલા અને છૂંદેલા બટાકા\n- 1/4 કપ બારીક સમારેલી કાકડી\n- 1/4 કપ બાફેલા અને ફણગાવેલા મગની દાળ (વૈકલ્પિક)\n- 2-3 ચમચી નાયલોન સેવ (પાતળા ચણાના લોટના નૂડલ્સ)\n- 2-3 ચમચી આમલીની ચટણી\n- 2-3 ચમચી લીલી ચટણી (ધાણા અને ફુદીનાની ચટણી)\n- 1 ચમચી ચાટ મસાલો\n- 1/2 ચમચી શેકેલું જીરું પાવડર\n- 1/2 ચમચી લાલ મરચું પાવડર (સ્વાદ પ્રમાણે)\n- સ્વાદ અનુસાર મીઠું\n- ગાર્નિશ માટે ઝીણી સમારેલી કોથમીર\n- સર્વ કરવા માટે લીંબુ ફાચર\n\nસૂચનાઓ:\n\n1. એક મોટા મિક્સિંગ બાઉલમાં, મુરમુરા ઉમેરો.\n2. મુર્મુરામાં સમારેલી ડુંગળી, ટામેટાં, કાકડી, છૂંદેલા બટાકા અને બાફેલા મગની દાળ (જો વાપરતા હોય તો) ઉમેરો.\n3. મિશ્રણ પર આમલીની ચટણી અને લીલી ચટણીને ઝરમર ઝરમર કરો.\nતમે તમારી સ્વાદ પસંદગી અનુસાર ચટણીની માત્રાને સમાયોજિત કરી શકો છો.\n4. મિશ્રણ પર ચાટ મસાલો, શેકેલું જીરું પાવડર, લાલ મરચું પાવડર અને મીઠું છાંટવું.\n5. જ્યાં સુધી બધી સામગ્રી સારી રીતે ભેગી થઈ જાય અને ચટણી અને મસાલા સાથે સરખી રીતે કોટ ન થઈ જાય ત્યાં સુધી બધું એકસાથે ટૉસ કરો.\n6. ભેલ સંચોરીને નાયલોનની સેવ અને સમારેલી કોથમીરથી ગાર્નિશ કરો.\n7. ભેલ સંચોરીને વ્યક્તિગત બાઉલ અથવા પ્લેટમાં તરત જ સર્વ કરો.\n8. વધારાના ટેન્ગી સ્વાદ માટે જમતા પહેલા ઉપરથી થોડો તાજો લીંબુનો રસ નીચોવો.\n\nતમારા ઘરે બનાવેલી ભેલ સાંચોરીનો આનંદ માણો. હેપી સ્નેકિંગ!",
    "image": "https://heavenlife.github.io/APITestingDemo/images/smosa.png"
  },
  {
    "id": 2,
    "recipename": "સ્ટફ્ડ કચોરી",
    "Tag": "Breakfast",
    "recipedetail": "સામગ્રી:\n\nબાહ્ય આવરણ માટે (પેસ્ટ્રી કણક):\n- 1 કપ સર્વ-હેતુનો લોટ (મેવડ)\n- 2 ચમચી સોજી (સૂજી/રવા)\n- 1/4 કપ ઘી અથવા વનસ્પતિ તેલ\n- એક ચપટી ખાવાનો સોડા\n- સ્વાદ અનુસાર મીઠું\n- ભેળવવા માટે પાણી\n\nભરવા માટે:\n\n- 1/2 કપ પીળી મગની દાળ (પીળી દાળને વિભાજીત કરો)\n- 1 ચમચી તેલ\n- 1/2 ચમચી જીરું\n- 1/2 ચમચી વરિયાળીના બીજ\n- 1/2 ચમચી આદુની પેસ્ટ\n- 1/2 ચમચી લીલા મરચાની પેસ્ટ (સ્વાદ પ્રમાણે)\n- 1/4 ચમચી હિંગ (હિંગ)\n- 1/2 ચમચી હળદર પાવડર\n- 1 ચમચી ધાણા પાવડર\n- 1/2 ચમચી લાલ મરચું પાવડર (સ્વાદ પ્રમાણે)\n- 1/2 ચમચી ગરમ મસાલો\n- સ્વાદ અનુસાર મીઠું\n- ગાર્નિશ માટે ઝીણી સમારેલી કોથમીર\n- ડીપ ફ્રાઈંગ માટે તેલ\n\nસૂચનાઓ:\n\nબાહ્ય આવરણ માટે (પેસ્ટ્રી કણક):\n1. એક મિક્સિંગ બાઉલમાં, સર્વ-હેતુનો લોટ, સોજી, મીઠું, ખાવાનો સોડા અને ઘી (અથવા વનસ્પતિ તેલ) ભેગું કરો.\n2. લોટ બ્રેડક્રમ્સ જેવો ન થાય ત્યાં સુધી ઘટકોને સારી રીતે મિક્સ કરો.\n3. ધીમે ધીમે ઓછી માત્રામાં પાણી ઉમેરો અને મિશ્રણને મક્કમ અને સરળ કણકમાં ભેળવો.\nકણક ખૂબ નરમ અથવા ખૂબ સખત ન હોવો જોઈએ.\nતેને ભીના કપડાથી ઢાંકીને 15-20 મિનિટ સુધી રહેવા દો.\n\nભરવા માટે:\n\n1. મગની દાળને ધોઈને લગભગ 30 મિનિટ સુધી પાણીમાં પલાળી રાખો. પાણીને સંપૂર્ણપણે નિતારી લો.\n2. પલાળેલી મગની દાળને ફૂડ પ્રોસેસર અથવા ગ્રાઇન્ડરમાં પાણી ઉમેર્યા વગર બરછટ પીસી લો.\n3. એક પેનમાં મધ્યમ તાપ પર તેલ ગરમ કરો. જીરું અને વરિયાળી ઉમેરો અને તેને ફાડવા દો.\n4. આદુની પેસ્ટ અને લીલા મરચાની પેસ્ટ ઉમેરો. એક મિનિટ માટે સાંતળો.\n5. હિંગ, હળદર પાવડર, ધાણા પાવડર, લાલ મરચું પાવડર, ગરમ મસાલો અને મીઠું ઉમેરો. સારી રીતે ભેળવી દો.\n6. પેનમાં બરછટ પીસેલી મગની દાળ ઉમેરો. દાળ બફાઈ જાય અને ભેજ બાષ્પીભવન થઈ જાય ત્યાં સુધી મિશ્રણને ધીમાથી મધ્યમ તાપ પર પકાવો. ભરણ શુષ્ક હોવું જોઈએ પરંતુ વધુ રાંધેલું નહીં.\n7. કચોરી માટે ઉપયોગ કરતા પહેલા ફિલિંગને સંપૂર્ણપણે ઠંડુ થવા દો. \n\n કચોરીને એસેમ્બલ કરવા અને તળવા માટે:\n\n1. કણકને લીંબુના કદના નાના બોલમાં વહેંચો.\n2. એક કણકનો બોલ લો અને તેને નાના વર્તુળમાં ફેરવો (આશરે 3-4 ઇંચ વ્યાસ).\n3. એક ચમચી ઠંડી કરેલી મગની દાળને વર્તુળની મધ્યમાં મૂકો.\n4. કણકની કિનારીઓને કેન્દ્રમાં ભેગી કરો, ભરણને યોગ્ય રીતે સીલ કરો, અને વધારાના કણકને ચપટી કરો.\n5. સ્ટફ્ડ બોલને તમારા હાથ વડે હળવા હાથે ચપટી કરો અને તેને લગભગ 3-4 ઇંચ વ્યાસની નાની ડિસ્ક (કચોરી) માં ફેરવો.\n6. મધ્યમ તાપ પર એક ઊંડા તવામાં તેલ ગરમ કરો.\n7. તેલ ગરમ થઈ જાય પછી, સ્ટફ્ડ કચોરીને કાળજીપૂર્વક ગરમ તેલમાં સ્લાઈડ કરો.\n8. કચોરીને ગોલ્ડન બ્રાઉન અને બંને બાજુથી ક્રિસ્પી થાય ત્યાં સુધી ફ્રાય કરો.\n9. કચોરીને તેલમાંથી કાઢી લો અને વધારાનું તેલ દૂર કરવા માટે તેને પેપર ટોવેલ પર મૂકો.\n10. બધી કચોરી આ જ રીતે તૈયાર કરો.\n\nતમારી મનપસંદ ચટણી સાથે ગરમાગરમ અને ક્રિસ્પી મૂંગ દાળ સ્ટફ્ડ કચોરીને સર્વ કરો. તેઓ નાસ્તા માટે અથવા ચાના સમયના નાસ્તા તરીકે યોગ્ય છે. આનંદ માણો!",
    "image": "https://heavenlife.github.io/APITestingDemo/images/smosa.png"
  },
  {
    "id": 3,
    "recipename": "આલુ પરાઠા",
    "Tag": "Breakfast",
    "recipedetail": "સામગ્રી:\n\nકણક માટે:\n\n- 2 કપ ઘઉંનો લોટ (આટા)\n- ભેળવવા માટે પાણી\n- એક ચપટી મીઠું\n- કણકને ગ્રીસ કરવા માટે 1 ટેબલસ્પૂન તેલ અથવા ઘી (સ્પષ્ટ માખણ).\n\n બટાટા ભરવા માટે:\n\n- 3 મધ્યમ કદના બટાકા, બાફેલા અને છૂંદેલા\n- 1 નાની ડુંગળી, બારીક સમારેલી (વૈકલ્પિક)\n- 2-3 લીલા મરચાં, બારીક સમારેલા (સ્વાદ પ્રમાણે)\n- 1/2 ચમચી છીણેલું આદુ\n- 1/2 ચમચી જીરું\n- 1/2 ચમચી ગરમ મસાલો\n- 1/2 ચમચી લાલ મરચું પાવડર (સ્વાદ પ્રમાણે) \n- 1/2 ચમચી આમચૂર પાવડર (સૂકી કેરી પાવડર) અથવા ચાટ મસાલો\n- સ્વાદ અનુસાર મીઠું\n- તાજા કોથમીર, બારીક સમારેલી\n- તળવા માટે ઘી અથવા તેલ\n\nસૂચનાઓ:\n\nકણક માટે:\n\n1. એક મિક્સિંગ બાઉલમાં, આખા ઘઉંનો લોટ અને એક ચપટી મીઠું ભેગું કરો.\n2. ધીમે ધીમે થોડી માત્રામાં પાણી ઉમેરો અને લોટને ભેળવો જેથી એક સરળ અને નરમ કણક બને. લોટ બહુ ચુસ્ત કે બહુ ઢીલો ન હોવો જોઈએ.\n3. એકવાર કણક તૈયાર થઈ જાય, તેની સપાટી પર તેલ અથવા ઘીના થોડા ટીપાં લગાવો અને તેને ભીના કપડાથી ઢાંકી દો. તેને લગભગ 15-20 મિનિટ સુધી આરામ કરવા દો.\n\nબટાટા ભરવા માટે:\n\n1. એક મિક્સિંગ બાઉલમાં, બાફેલા અને છૂંદેલા બટાકા ઉમેરો.\n2. છૂંદેલા બટાકામાં, બારીક સમારેલી ડુંગળી (જો વાપરી રહ્યા હોય), લીલા મરચાં, છીણેલું આદુ, જીરું, ગરમ મસાલો, લાલ મરચું પાવડર, આમચૂર પાવડર અથવા ચાટ મસાલો, મીઠું, અને સમારેલી કોથમીર ઉમેરો.\n3. તમામ ઘટકોને સારી રીતે મિક્સ કરો, ખાતરી કરો કે બટાકાના મિશ્રણમાં મસાલા સમાનરૂપે વિતરિત થાય છે. તમારા સ્વાદ અનુસાર મસાલાને સમાયોજિત કરો.\nઆલુ પરાઠાને એસેમ્બલ કરવા અને રાંધવા:\n1. કણકને સમાન-કદના બોલમાં વિભાજીત કરો, બટાટા ભરવાના બોલ કરતાં સહેજ મોટા.\n2. એક કણકનો બોલ લો અને તેને એક નાના વર્તુળમાં (આશરે 3-4 ઇંચ વ્યાસમાં) રોલિંગ પિન અને ધૂળ માટે થોડો સૂકો લોટનો ઉપયોગ કરો.\n3. રોલ્ડ કણકની મધ્યમાં બટાકાની ભરણનો એક ભાગ મૂકો.\n4. કણકની કિનારીઓને કેન્દ્ર તરફ ભેગી કરો, ભરણને યોગ્ય રીતે સીલ કરો અને વધારાના કણકને ચપટી કરો.\n5. સ્ટફ્ડ બોલને તમારા હાથ વડે હળવેથી ચપટી કરો.\n6. રોલિંગ પિનનો ઉપયોગ કરીને અને જરૂર મુજબ લોટ વડે ધૂળ નાંખીને થોડા જાડા વર્તુળમાં (લગભગ 6-7 ઇંચ વ્યાસ) ચપટા બોલને ફરીથી રોલ કરો.\n7. એક તવા અથવા તવાને મધ્યમ તાપ પર ગરમ કરો.\n8. રોલ્ડ આલૂ પરાઠાને ગરમ તવા પર મૂકો અને તેને બંને બાજુએ ઘી અથવા તેલ લગાવીને પકાવો.\n9. જ્યાં સુધી પરાઠા ગોલ્ડન બ્રાઉન ન થાય અને તેની કિનારીઓ ક્રિસ્પી ન થાય ત્યાં સુધી રાંધો.\n10. વધુ પરાઠા બનાવવા માટે બાકીના કણક અને બટાકાની ભરણ સાથે પ્રક્રિયાને પુનરાવર્તિત કરો.\n11. ગરમાગરમ અને સ્વાદિષ્ટ આલૂ પરાઠાને દહીં, અથાણું અથવા તમારી પસંદગીની કોઈપણ ચટણી સાથે સર્વ કરો.\n\nતમારા પ્રિયજનો સાથે આનંદદાયક ભોજન તરીકે સ્વાદિષ્ટ આલૂ પરાઠાનો આનંદ માણો!",
    "image": "https://heavenlife.github.io/APITestingDemo/images/smosa.png"
  },
  {
    "id": 4,
    "recipename": "પાવ ભાજી પરાઠા",
    "Tag": "Breakfast",
    "recipedetail": "સામગ્રી:\n\n પરાઠા કણક માટે:\n\n- 2 કપ ઘઉંનો લોટ (આટા)\n- ભેળવવા માટે પાણી\n- એક ચપટી મીઠું\n- કણકને ગ્રીસ કરવા માટે 1 ટેબલસ્પૂન તેલ અથવા ઘી (સ્પષ્ટ માખણ).\n\n પાવભાજી ભરવા માટે:\n\n- 3 મધ્યમ કદના બટાકા, બાફેલા અને છૂંદેલા\n- 1 કપ મિશ્ર શાકભાજી\n(ગાજર, વટાણા, કઠોળ, કોબીજ), બાફેલા અને છૂંદેલા\n- 1 મધ્યમ કદની ડુંગળી, બારીક સમારેલી\n- 1 મધ્યમ કદના ટામેટા, બારીક સમારેલા\n- 1 લીલું મરચું (કેપ્સીકમ), બારીક સમારેલ\n- 2-3 લીલા મરચાં, બારીક સમારેલા (સ્વાદ પ્રમાણે)\n- 1-ઇંચ આદુનો ટુકડો, છીણેલું\n- લસણની 4-5 લવિંગ, ઝીણી સમારેલી\n- 1/2 ચમચી જીરું\n- 1/2 ચમચી હળદર પાવડર\n- 1 ટેબલસ્પૂન પાવ ભાજી મસાલો\n- 1 ટેબલસ્પૂન લાલ મરચું પાવડર (સ્વાદ પ્રમાણે)\n- સ્વાદ અનુસાર મીઠું\n- 2 ચમચી માખણ\n- તાજા કોથમીર, બારીક સમારેલી\n- સર્વ કરવા માટે લીંબુ ફાચર\n- તળવા માટે ઘી અથવા તેલ\n\nસૂચનાઓ:\n\nપરાઠા કણક માટે:\n\n1. એક મિક્સિંગ બાઉલમાં, આખા ઘઉંનો લોટ અને એક ચપટી મીઠું ભેગું કરો.\n2. ધીમે ધીમે થોડી માત્રામાં પાણી ઉમેરો અને લોટને ભેળવો જેથી એક સરળ અને નરમ કણક બને. લોટ બહુ ચુસ્ત કે બહુ ઢીલો ન હોવો જોઈએ.\n3. એકવાર કણક તૈયાર થઈ જાય, તેની સપાટી પર તેલ અથવા ઘીના થોડા ટીપાં લગાવો અને તેને ભીના કપડાથી ઢાંકી દો. તેને લગભગ 15-20 મિનિટ સુધી આરામ કરવા દો.\n\n પાવભાજી ભરવા માટે:\n1. એક મોટા પેનમાં, 2 ચમચી માખણને મધ્યમ તાપ પર ગરમ કરો.\n2. જીરું ઉમેરો અને તેને ફાડવા દો.\n3. બારીક સમારેલી ડુંગળી ઉમેરો અને તે અર્ધપારદર્શક ન થાય ત્યાં સુધી સાંતળો.\n4. છીણેલું લસણ, છીણેલું આદુ અને સમારેલા લીલા મરચા ઉમેરો. એક મિનિટ માટે સાંતળો.\n5. બારીક સમારેલા ટામેટાં ઉમેરો અને જ્યાં સુધી તે નરમ અને ચીકણું ન બને ત્યાં સુધી પકાવો.\n6. બારીક સમારેલા લીલા મરચાં (કેપ્સિકમ) ઉમેરો અને થોડીવાર સાંતળો.\n7. હવે, બાફેલા અને છૂંદેલા બટાકાની સાથે બાફેલા અને છૂંદેલા મિશ્ર શાકભાજી ઉમેરો.\n8. બધું સારી રીતે મિક્સ કરો અને ચમચી અથવા મશરની પાછળ શાકભાજીને વધુ મેશ કરો.\n9. પાવભાજી મસાલો, હળદર પાવડર, લાલ મરચું પાવડર અને સ્વાદ અનુસાર મીઠું ઉમેરો. સારી રીતે મિક્સ કરો અને થોડી વધુ મિનિટ માટે રાંધો.\n10. સમારેલી કોથમીર ઉમેરો અને મિક્સ કરો.\n\nપાવભાજી પરાઠાને એસેમ્બલ અને રાંધવા:\n\n1. કણકને સમાન કદના બોલમાં વિભાજીત કરો.\n2. એક કણકનો બોલ લો અને તેને એક નાના વર્તુળમાં (આશરે 3-4 ઇંચ વ્યાસમાં) રોલિંગ પિન અને ધૂળ માટે થોડો સૂકો લોટનો ઉપયોગ કરો.\n3. તૈયાર પાવભાજીનો એક ભાગ રોલ્ડ કણકની મધ્યમાં મૂકો.\n4. કણકની કિનારીઓને કેન્દ્ર તરફ ભેગી કરો, ભરણને યોગ્ય રીતે સીલ કરો અને વધારાના કણકને ચપટી કરો.\n5. સ્ટફ્ડ બોલને તમારા હાથ વડે હળવેથી ચપટી કરો.\n6. રોલિંગ પિનનો ઉપયોગ કરીને અને જરૂર મુજબ લોટ વડે ધૂળ નાંખીને થોડા જાડા વર્તુળમાં (લગભગ 6-7 ઇંચ વ્યાસ) ચપટા બોલને ફરીથી રોલ કરો.\n7. એક તવા અથવા તવાને મધ્યમ તાપ પર ગરમ કરો.\n8. પાવભાજી પરાઠાને ગરમ તવા પર મૂકો અને તેને બંને બાજુએ ઘી અથવા તેલ લગાવીને રાંધો.\n9. જ્યાં સુધી પરાઠા ગોલ્ડન બ્રાઉન ન થાય અને તેની કિનારીઓ ક્રિસ્પી ન થાય ત્યાં સુધી રાંધો.\n10. વધુ પાવભાજી પરાઠા બનાવવા માટે બાકીના કણક અને ભરણ સાથે પ્રક્રિયાને પુનરાવર્તિત કરો.\n11. ગરમ અને સ્વાદિષ્ટ પાવભાજી પરાઠાને ઉપર માખણની ડોલ અને બાજુ પર લીંબુની છીણ સાથે સર્વ કરો.\n\n આનંદદાયક ભોજન અથવા નાસ્તા તરીકે અનન્ય અને સ્વાદિષ્ટ પાવભાજી પરાઠાનો આનંદ માણો!",
    "image": "https://heavenlife.github.io/APITestingDemo/images/smosa.png"
  },
  {
    "id": 5,
    "recipename": "Veg Pulao",
    "Tag": "Lunch",
    "recipedetail": "A refreshing salad with tomatoes, cucumbers, olives, and feta cheese.",
    "image": "https://heavenlife.github.io/APITestingDemo/images/smosa.png"
  },
  {
    "id": 6,
    "recipename": "Pratha",
    "Tag": "Breakfast",
    "recipedetail": "A refreshing salad with tomatoes, cucumbers, olives, and feta cheese.",
    "image": "https://heavenlife.github.io/APITestingDemo/images/smosa.png"
  }       
 ]
}
