{
    "AllRecipe": [
  {
    "id": 1,
    "recipename": "ગુજરાતી હાંડવો:",
    "Tag": "Breakfast",
    "recipedetail": "ઘટકો:
- 1 કપ ચોખા (પ્રાધાન્યમાં બાફેલા ચોખા)
- 1/4 કપ વટાણા (તૂર દાળ)
- 1/4 કપ ચણાની દાળ (ચણાની દાળ)
- 1/4 કપ સ્પ્લિટ કાળા ચણા (અડદની દાળ)
- 1/4 કપ લીલા ચણા (મગની દાળ)
- 1/4 કપ છીણેલી બોટલ ગોળ (દૂધી/લૌકી)
- 1/4 કપ છીણેલું ગાજર
- 1/4 કપ છીણેલું ઝુચીની (વૈકલ્પિક)
- 1/4 કપ દહીં (દહીં)
- 1 ટેબલસ્પૂન આદુ-લીલા મરચાની પેસ્ટ
- 1/2 ચમચી હળદર પાવડર
- 1 ચમચી લાલ મરચું પાવડર (સ્વાદ પ્રમાણે)
- 1/2 ચમચી જીરું
- 1/2 ચમચી સરસવ
- 1/4 ચમચી હિંગ (હિંગ)
- 1 ચમચી તલ
- 2 ચમચી ઝીણી સમારેલી કોથમીર
- 2 ચમચી તેલ + ગ્રીસિંગ માટે વધારાનું
- સ્વાદ અનુસાર મીઠું
- 1 ચમચી ઈનો ફ્રુટ સોલ્ટ (અથવા 1/2 ચમચી ખાવાનો સોડા)
- બેટરની સુસંગતતા માટે જરૂર મુજબ પાણી

સૂચનાઓ:
1. ચોખા અને બધી દાળ (તુવેરની દાળ, ચણાની દાળ, અડદની દાળ અને મગની દાળ)ને એકસાથે ધોઈને લગભગ 4-5 કલાક અથવા આખી રાત પાણીમાં પલાળી રાખો. પલાળ્યા પછી પાણી કાઢી લો.

2. બ્લેન્ડર અથવા ફૂડ પ્રોસેસરમાં, પલાળેલા ચોખા અને દાળને સ્મૂધ બેટરમાં પીસી લો. પેનકેક જેવી બેટર સુસંગતતા મેળવવા માટે પીસતી વખતે જરૂર મુજબ પાણી ઉમેરો.

3. બેટરને એક મોટા મિક્સિંગ બાઉલમાં સ્થાનાંતરિત કરો. છીણેલી શીશી, છીણેલું ગાજર, છીણેલું ઝુચિની (જો વાપરતા હોય તો), દહીં, આદુ-લીલા મરચાંની પેસ્ટ, હળદર પાવડર, લાલ મરચાંનો પાવડર, જીરું, સરસવ, હિંગ, ઝીણી સમારેલી કોથમીર અને મીઠું ઉમેરો. ભેગા કરવા માટે બધું બરાબર મિક્સ કરો.

4. બાઉલને ઢાંકણ અથવા કપડા વડે ઢાંકી દો અને બેટરને 6-8 કલાક અથવા આખી રાત આથો આવવા દો. આથો સ્વાદમાં વધારો કરે છે અને હાંડવાને સરળ બનાવે છે.

5. આથો પછી, બેટરની સુસંગતતા તપાસો. તે જાડા છતાં રેડી શકાય તેવું હોવું જોઈએ. જો તે ખૂબ જાડું હોય, તો એડજસ્ટ કરવા માટે થોડું પાણી ઉમેરો.

રસોઈ હાંડવો:
1. ઓવનને 180°C (350°F) પર પહેલાથી ગરમ કરો. ગોળ અથવા ચોરસ બેકિંગ ડીશને તેલથી ગ્રીસ કરો.

2. બેટરમાં ઈનો ફ્રુટ સોલ્ટ (અથવા ખાવાનો સોડા) ઉમેરો અને હળવા હાથે મિક્સ કરો. બેટર ફેણવાળું બની જશે.

3. બેટરને ગ્રીસ કરેલી બેકિંગ ડીશમાં રેડો અને તેને સરખી રીતે ફેલાવો.

4. બેટરની ઉપર તલ છાંટો.

5. હેન્ડવોને પ્રીહિટેડ ઓવનમાં 30-40 મિનિટ સુધી અથવા મધ્યમાં નાખેલી ટૂથપીક સાફ બહાર આવે અને ટોચ ગોલ્ડન બ્રાઉન થાય ત્યાં સુધી બેક કરો.

6. એકવાર શેકાઈ જાય પછી, હેંડવોના ટુકડા કરતા પહેલા તેને થોડી મિનિટો માટે ઠંડુ થવા દો.

પીરસવું:
1. હાંડવોને લીલી ચટણી અથવા આમલીની ચટણી સાથે ગરમાગરમ સર્વ કરો.

હાંડવો એ એક સ્વાદિષ્ટ અને સંતોષકારક નાસ્તો છે જે ચાના સમય માટે અથવા હળવા ભોજન તરીકે યોગ્ય છે. આ અધિકૃત ગુજરાતી વાનગીનો સ્વાદ માણો!",
    "image": "https://heavenlife.github.io/APITestingDemo/images/smosa.png"
  },
  {
    "id": 2,
    "recipename": "Chicken Curry",
    "Tag": "Lunch",
    "recipedetail": "A flavorful Indian curry made with tender chicken and aromatic spices.",
    "image": "https://heavenlife.github.io/APITestingDemo/images/smosa.png"
  },
  {
    "id": 3,
    "recipename": "Greek Salad",
    "Tag": "Dinner",
    "recipedetail": "A refreshing salad with tomatoes, cucumbers, olives, and feta cheese.",
    "image": "https://heavenlife.github.io/APITestingDemo/images/smosa.png"
  }
 ]
}
